espressif/esp-idf/components/soc/esp32p4/include/soc/lp_aonclkrst_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: configure_register */
/** Type of lp_clk_conf register
 *  need_des
 */
typedef union {
    struct {
        /** slow_clk_sel : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t slow_clk_sel:2;
        /** fast_clk_sel : R/W; bitpos: [3:2]; default: 1;
         *  need_des
         */
        uint32_t fast_clk_sel:2;
        /** lp_peri_div_num : R/W; bitpos: [9:4]; default: 0;
         *  need_des
         */
        uint32_t lp_peri_div_num:6;
        /** ana_sel_ref_pll8m : R/W; bitpos: [10]; default: 0;
         *  need_des
         */
        uint32_t ana_sel_ref_pll8m:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} lp_aonclkrst_lp_clk_conf_reg_t;

/** Type of lp_clk_po_en register
 *  need_des
 */
typedef union {
    struct {
        /** clk_core_efuse_oen : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t clk_core_efuse_oen:1;
        /** clk_lp_bus_oen : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t clk_lp_bus_oen:1;
        /** clk_aon_slow_oen : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t clk_aon_slow_oen:1;
        /** clk_aon_fast_oen : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t clk_aon_fast_oen:1;
        /** clk_slow_oen : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t clk_slow_oen:1;
        /** clk_fast_oen : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t clk_fast_oen:1;
        /** clk_fosc_oen : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t clk_fosc_oen:1;
        /** clk_rc32k_oen : R/W; bitpos: [7]; default: 0;
         *  need_des
         */
        uint32_t clk_rc32k_oen:1;
        /** clk_sxtal_oen : R/W; bitpos: [8]; default: 0;
         *  need_des
         */
        uint32_t clk_sxtal_oen:1;
        /** clk_sosc_oen : R/W; bitpos: [9]; default: 0;
         *  1'b1: probe sosc clk on
         *  1'b0: probe sosc clk off
         */
        uint32_t clk_sosc_oen:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} lp_aonclkrst_lp_clk_po_en_reg_t;

/** Type of lp_clk_en register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:26;
        /** lp_rtc_xtal_force_on : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lp_rtc_xtal_force_on:1;
        /** ck_en_lp_ram : R/W; bitpos: [27]; default: 1;
         *  need_des
         */
        uint32_t ck_en_lp_ram:1;
        /** etm_event_tick_en : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t etm_event_tick_en:1;
        /** pll8m_clk_force_on : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t pll8m_clk_force_on:1;
        /** xtal_clk_force_on : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t xtal_clk_force_on:1;
        /** fosc_clk_force_on : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t fosc_clk_force_on:1;
    };
    uint32_t val;
} lp_aonclkrst_lp_clk_en_reg_t;

/** Type of lp_rst_en register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** rst_en_lp_huk : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_huk:1;
        /** rst_en_lp_anaperi : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_anaperi:1;
        /** rst_en_lp_wdt : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_wdt:1;
        /** rst_en_lp_timer : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_timer:1;
        /** rst_en_lp_rtc : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_rtc:1;
        /** rst_en_lp_mailbox : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_mailbox:1;
        /** rst_en_lp_aonefusereg : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_aonefusereg:1;
        /** rst_en_lp_ram : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t rst_en_lp_ram:1;
    };
    uint32_t val;
} lp_aonclkrst_lp_rst_en_reg_t;

/** Type of reset_cause register
 *  need_des
 */
typedef union {
    struct {
        /** lpcore_reset_cause : RO; bitpos: [5:0]; default: 0;
         *  6'h1: POR reset
         *  6'h9: PMU LP PERI power down reset
         *  6'ha: PMU LP CPU reset
         *  6'hf: brown out reset
         *  6'h10: LP watchdog chip reset
         *  6'h12: super watch dog reset
         *  6'h13: glitch reset
         *  6'h14: software reset
         */
        uint32_t lpcore_reset_cause:6;
        /** lpcore_reset_flag : RO; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t lpcore_reset_flag:1;
        /** hpcore0_reset_cause : RO; bitpos: [12:7]; default: 0;
         *  6'h1: POR reset
         *  6'h3: digital system software reset
         *  6'h5: PMU HP system power down reset
         *  6'h7: HP system reset from HP watchdog
         *  6'h9: HP system reset from LP watchdog
         *  6'hb: HP core reset from HP watchdog
         *  6'hc: HP core software reset
         *  6'hd: HP core reset from LP watchdog
         *  6'hf: brown out reset
         *  6'h10: LP watchdog chip reset
         *  6'h12: super watch dog reset
         *  6'h13: glitch reset
         *  6'h14: efuse crc error reset
         *  6'h16: HP usb jtag chip reset
         *  6'h17: HP usb uart chip reset
         *  6'h18: HP jtag reset
         *  6'h1a: HP core lockup
         */
        uint32_t hpcore0_reset_cause:6;
        /** hpcore0_reset_flag : RO; bitpos: [13]; default: 0;
         *  need_des
         */
        uint32_t hpcore0_reset_flag:1;
        /** hpcore1_reset_cause : RO; bitpos: [19:14]; default: 0;
         *  6'h1: POR reset
         *  6'h3: digital system software reset
         *  6'h5: PMU HP system power down reset
         *  6'h7: HP system reset from HP watchdog
         *  6'h9: HP system reset from LP watchdog
         *  6'hb: HP core reset from HP watchdog
         *  6'hc: HP core software reset
         *  6'hd: HP core reset from LP watchdog
         *  6'hf: brown out reset
         *  6'h10: LP watchdog chip reset
         *  6'h12: super watch dog reset
         *  6'h13: glitch reset
         *  6'h14: efuse crc error reset
         *  6'h16: HP usb jtag chip reset
         *  6'h17: HP usb uart chip reset
         *  6'h18: HP jtag reset
         *  6'h1a: HP core lockup
         */
        uint32_t hpcore1_reset_cause:6;
        /** hpcore1_reset_flag : RO; bitpos: [20]; default: 0;
         *  need_des
         */
        uint32_t hpcore1_reset_flag:1;
        uint32_t reserved_21:4;
        /** lpcore_reset_cause_pmu_lp_cpu_mask : R/W; bitpos: [25]; default: 1;
         *  1'b0: enable lpcore pmu_lp_cpu_reset reset_cause, 1'b1: disable lpcore
         *  pmu_lp_cpu_reset reset_cause
         */
        uint32_t lpcore_reset_cause_pmu_lp_cpu_mask:1;
        /** lpcore_reset_cause_clr : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t lpcore_reset_cause_clr:1;
        /** lpcore_reset_flag_clr : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t lpcore_reset_flag_clr:1;
        /** hpcore0_reset_cause_clr : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t hpcore0_reset_cause_clr:1;
        /** hpcore0_reset_flag_clr : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t hpcore0_reset_flag_clr:1;
        /** hpcore1_reset_cause_clr : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t hpcore1_reset_cause_clr:1;
        /** hpcore1_reset_flag_clr : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hpcore1_reset_flag_clr:1;
    };
    uint32_t val;
} lp_aonclkrst_reset_cause_reg_t;

