espressif/esp-idf/components/soc/esp32p4/include/soc/lp_aonclkrst_struct.h
typedef struct {
    volatile lp_aonclkrst_lp_clk_conf_reg_t lp_clk_conf;
    volatile lp_aonclkrst_lp_clk_po_en_reg_t lp_clk_po_en;
    volatile lp_aonclkrst_lp_clk_en_reg_t lp_clk_en;
    volatile lp_aonclkrst_lp_rst_en_reg_t lp_rst_en;
    volatile lp_aonclkrst_reset_cause_reg_t reset_cause;
    volatile lp_aonclkrst_hpcpu_reset_ctrl0_reg_t hpcpu_reset_ctrl0;
    volatile lp_aonclkrst_hpcpu_reset_ctrl1_reg_t hpcpu_reset_ctrl1;
    volatile lp_aonclkrst_fosc_cntl_reg_t fosc_cntl;
    volatile lp_aonclkrst_rc32k_cntl_reg_t rc32k_cntl;
    volatile lp_aonclkrst_sosc_cntl_reg_t sosc_cntl;
    volatile lp_aonclkrst_clk_to_hp_reg_t clk_to_hp;
    volatile lp_aonclkrst_lpmem_force_reg_t lpmem_force;
    volatile lp_aonclkrst_xtal32k_reg_t xtal32k;
    volatile lp_aonclkrst_mux_hpsys_reset_bypass_reg_t mux_hpsys_reset_bypass;
    volatile lp_aonclkrst_hpsys_0_reset_bypass_reg_t hpsys_0_reset_bypass;
    volatile lp_aonclkrst_hpsys_apm_reset_bypass_reg_t hpsys_apm_reset_bypass;
    volatile lp_aonclkrst_hp_clk_ctrl_reg_t hp_clk_ctrl;
    volatile lp_aonclkrst_hp_usb_clkrst_ctrl0_reg_t hp_usb_clkrst_ctrl0;
    volatile lp_aonclkrst_hp_usb_clkrst_ctrl1_reg_t hp_usb_clkrst_ctrl1;
    volatile lp_aonclkrst_hp_sdmmc_emac_rst_ctrl_reg_t hp_sdmmc_emac_rst_ctrl;
    uint32_t reserved_050[235];
    volatile lp_aonclkrst_date_reg_t date;
} lp_aonclkrst_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(lp_aonclkrst_dev_t) == 0x400, "Invalid size of lp_aonclkrst_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
